#ifndef __DeviceReagent_H
#define __DeviceReagent_H	 
#include "sys.h"  	
//TC parameter  command
/*
MENU:INFO?\r  TC1:TCACTUALTEMP=21.14   TC1:TCACTUALTEMP?\r  TC1:TCADJUSTTEMP=8.00  TC1:TCADJUSTTEMP?    @0

TC1:TCMAXSETTEMP? TC1:TCRAMPSPEED=30.000  TC1:TCMAXSETTEMP? TC1:TCMAXSETTEMP=101.00  TC1:TCMINSETTEMP?  TC1:TCMINSETTEMP=-10.00  TC1:TCSTEPTEMP? TC1:TCSTEPTEMP=1.00

TC1:TCMAXV? TC1:TCMAXV=13.00  TC1:TCCOOLVRATIO? TC1:TCCOOLVRATIO=1.00  
TC1:TCMODE? TC1:TCMODE=0 TC1:TCSW? TC1:TCSW=0 TC1:TCOE?  TC1:TCOE=0   //most important 
TC1:TCSETVOLTAGE? TC1:TCSETVOLTAGE=0.00 TC1:TCACTUALVOLTAGE? TC1:TCACTUALVOLTAGE=0.09  TC1:TCACTUALCURRENT?  TC1:TCACTUALCURRENT=0.16 TC1:TCHARDWARE?  TC1:TCHARDWARE=1

TC1:TCTEMPSENSOR? TC1:TCTEMPSENSOR=0  TC1:TCSENSOROFFSET? TC1:TCSENSOROFFSET=0.00 TC1:TCTEMPAMPMODE? TC1:TCTEMPAMPMODE=0 
TC1:TCDIFFAMPT1? TC1:TCDIFFAMPT1=0.00  TC1:TCDIFFAMPT2? TC1:TCDIFFAMPT2=0.00  TC1:TCR0? TC1:TCR0=10.00  TC1:TCRS? TC1:TCRS=11.00  
TC1:TCNTCCAL? TC1:TCNTCCAL=0 TC1:TCNTCBETA? TC1:TCNTCBETA=3950.00 TC1:TCNTCC1? TC1:TCNTCC1=1.1236 TC1:TCNTCC2? TC1:TCNTCC2=2.3505  TC1:TCNTCC3? TC1:TCNTCC3=8.4336  TC1:TCPTC1? TC1:TCPTC1=3.9083 TC1:TCPTC2? TC1:TCPTC2=-5.7750

TC1:TCRTOCEF? TC1:TCRTOCEF=1  TC1:TCRTOCPE?  TC1:TCRTOCPE=1   TC1:TCRTOCPLT? TC1:TCRTOCPLT=-20.00  TC1:TCRTOCPHT? TC1:TCRTOCPHT=100.00

TC1:TCPIDTYPE?   TC1:TCPIDTYPE=1   TC1:TCP? TC1:TCP=0.600 TC1:TCTI? TC1:TCTI=40.00  TC1:TCTD? TC1:TCTD=0.10  TC1:TCPIDOFFSET? TC1:TCPIDOFFSET=0.00 TC1:TCPIDCAL? TC1:TCPIDCAL=0 TC1:TCPIDWINDOW?  TC1:TCPIDWINDOW=1 TC1:TCPIDACCWINDOW? TC1:TCPIDACCWINDOW=1

TC1:TCOVPE? TC1:TCOVPE=1 TC1:TCADJUSTOVPV? TC1:TCADJUSTOVPV=24.01 TC1:TCOVPV? TC1:TCOVPV=22.49   TC1:TCOVEF? TC1:TCOVEF=1

TC1:TCOCPE?  TC1:TCOCPE=1  TC1:TCADJUSTOCPC?   TC1:TCADJUSTOCPC=10.00  TC1:TCOCPC? TC1:TCOCPC=10.07 TC1:TCOCEF? TC1:TCOCEF=1 TC1:TCOCLE? TC1:TCOCLE=1 TC1:TCOCLC?  TC1:TCOCLC=8.50

TC1:TCOTPE? TC1:TCOTPE=1 TC1:TCOTPLT? TC1:TCOTPLT=-10.00  TC1:TCOTPHT? TC1:TCOTPHT=101.00 TC1:TCOTEF? TC1:TCOTEF=1 TC1:TCOTPHYS? TC1:TCOTPHYS=1.00

TC1:TCARE?  TC1:TCARE=0  TC1:TCMAXAR? TC1:TCMAXAR=255   TC1:TCARCNT? TC1:TCARCNT=0  TC1:TCARDELAY? TC1:TCARDELAY=3 

*/


#define FAN PFout(9)	 //


//////////////////////////////////////////////////////////////////////////////////	 
//All rights reserved									  
////////////////////////////////////////////////////////////////////////////////// 	 
typedef struct {
	
	//void 
	u8 RSoftVerM;  //02
	u8 RSoftVerS;
	u8 RSoftVer;
	u32 RSoftTimer;   //03
	u8 RHardwareVerM;  //04
	u8 RHardwareVerS;  
	u8 RHardwareVer;
	u32 RHardwareTimer;  //05
	
	u8 RAdressID; //11
	u16 RBoudValue; //12
	

	
	float ReagentTemper; //31
	u8 ReagentTime; //32


	u8 RWorkState; //41
  float RRealTemper; //42

} DeviceReagent;


extern DeviceReagent ReagentX;	
	
//TEMP conrol timer control  
//extern u16 Current_Positon;
//extern u16 Last_Positon;
//extern u16 Current_Speed;
//extern u16 Last_Speed;

void RScanDevice(u8 D); //01
void RInitDevice(u8 D); //41
//void ClearErr(u8 D);   //42

void RStart(void); //42

void InitFan(void);

void ReagentApp(void);
	 
void REmergyStop(void);//44

#endif
